---
type: Conduit
namespace: Autodesk.Revit.DB.Electrical
version: 2024
members: 3
tags: [revit-api, class]
---

# Conduit

`Autodesk.Revit.DB.Electrical.Conduit` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | — | `public static Conduit Create ( Document document , ElementId conduitType , XYZ startPoint , XYZ endPoint , ElementId levelId )` |
| Method | IsValidConduitType | — | `public static bool IsValidConduitType ( Document document , ElementId conduitType )` |
| Property | Parameter | — | `` |